lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdarg.h>

#include <stm32f4xx_hal.h>

#include "ff.h"
#include "diskio.h"

#include "defs.h"
#include "delay.h"

void set_GPIO_value(GPIO_TypeDef* gpio, int mask, int value)
{
    unsigned long int data = value ? mask : 0;
    gpio->ODR = (gpio->ODR & ~mask) | data;
}

void set_GPIO_iotype(GPIO_TypeDef* gpio, int pin, unsigned int iotype)
{
    long unsigned int mask = ~(3U << (pin * 2));
    long unsigned int value = iotype << (pin * 2);
    gpio->MODER = (gpio->MODER & mask) | value;
}

#if ALICE3_VERSION == ALICE3_V1

#define LED_PIN_MASK GPIO_PIN_13
#define LED_PORT GPIOC

#else // ALICE3_VERSION == ALICE3_V3

#define LED_PIN_MASK GPIO_PIN_2
#define LED_PORT GPIOB

#endif

void LED_set_panic(int on)
{
    HAL_GPIO_WritePin(LED_PORT, LED_PIN_MASK, on);
}

void LED_beat_heart()
{
    static int heartbeat_level = 1;
    static unsigned int previous_heartbeat_tick = 0;

    unsigned int now = HAL_GetTick();
    if(heartbeat_level == 1) {
        if(now - previous_heartbeat_tick > 350) {
            heartbeat_level = 0;
            HAL_GPIO_WritePin(LED_PORT, LED_PIN_MASK, heartbeat_level);
            previous_heartbeat_tick = now;
        }
    } else {
        if(now - previous_heartbeat_tick > 650) {
            heartbeat_level = 1;
            HAL_GPIO_WritePin(LED_PORT, LED_PIN_MASK, heartbeat_level);
            previous_heartbeat_tick = now;
        }
    }
}

void LED_set_info(int on)
{
    HAL_GPIO_WritePin(LED_PORT, LED_PIN_MASK, on);
}

void LED_init()
{
    GPIO_InitTypeDef  GPIO_InitStruct;

    GPIO_InitStruct.Pin = LED_PIN_MASK;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(LED_PORT, &GPIO_InitStruct); 

    HAL_GPIO_WritePin(LED_PORT, LED_PIN_MASK, 1);
}

void panic_worse()
{
    HAL_GPIO_WritePin(LED_PORT, LED_PIN_MASK, 0);
    LED_set_panic(1);
    for(;;);
}

void serial_flush();

static void panic(void)
{
    static int entered = 0;

    LED_set_panic(1);

    int pin = 0;
    for(;;) {
        if(!entered) {
            // serial_flush() can itself panic(), so stop reentry here
            entered = 1;
            serial_flush();
            entered = 0;
        }

        LED_set_panic(pin);
        pin = pin ? 0 : 1;
        delay_ms(100);
    }
}

void bell()
{
    putchar('\a');
}

int isprint(unsigned char a)
{
    return (a >= ' ') && (a <= '~');
}

unsigned char gConsoleOverflowed = 0;
unsigned char gKeyboardOverflowed = 0;

enum DebugLevels {
    DEBUG_SILENT = 0,
    DEBUG_ERRORS,
    DEBUG_WARNINGS,
    DEBUG_EVENTS,
    DEBUG_DATA,
    DEBUG_ALL,
    DEBUG_INSANE = 99,
};
int gDebugLevel = DEBUG_WARNINGS;

void dump_buffer_hex(int indent, const unsigned char *data, int size)
{
    int address = 0;
    int i;

    while(size > 0) {
        int howmany = (size < 16) ? size : 16;

        printf("%*s0x%04X: ", indent, "", address);
        for(i = 0; i < howmany; i++)
            printf("%02X ", data[i]);
        printf("\n");
        serial_flush();

        printf("%*s        ", indent, "");
        for(i = 0; i < howmany; i++)
            printf(" %c ", isprint(data[i]) ? data[i] : '.');
        printf("\n");
        serial_flush();

        size -= howmany;
        data += howmany;
        address += howmany;
    }
}

//----------------------------------------------------------------------------
// System Initialization Goop

static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;

  /* Enable Power Control clock */
  __HAL_RCC_PWR_CLK_ENABLE();
  
  /* The voltage scaling allows optimizing the power consumption when the device is 
     clocked below the maximum system frequency, to update the voltage scaling value 
     regarding system frequency refer to product datasheet.  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);
  
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 16; // Divide HSE by this
  RCC_OscInitStruct.PLL.PLLN = 336; // Then multiply by this
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2; // Then divide by this
  RCC_OscInitStruct.PLL.PLLQ = 7; // Divide by this for SD, USB OTG FS, and some other peripherals
  if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    panic();
  }

  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4; // APB1 will be 42MHz
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2; // APB2 will be 84MHz
  // grantham - 5 cycles for 168MHz is stated in Table 10 in the STM32F4 reference manual
  if(HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    panic();
  }
}

void system_init()
{
    HAL_Init();

    SystemClock_Config();

    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();

    delay_init();
}


//----------------------------------------------------------------------------
// Byte consumer-producer queue

struct queue {
    short next_head;
    short tail;
    unsigned short capacity;
    unsigned char queue[];
};

void queue_init(volatile struct queue *q, unsigned short capacity)
{
    q->next_head = 0;
    q->tail = 0;
    q->capacity = capacity;
}

// Protect with critical section if not called from producer
int queue_isfull(volatile struct queue *q)
{
    int length = (q->next_head + q->capacity - q->tail) % q->capacity;
    return length == q->capacity - 1;
}

// Protect with critical section if not called from consumer
int queue_isempty(volatile struct queue *q)
{
    return q->next_head == q->tail;
}

// Protect with critical section if not called from producer
void queue_enq(volatile struct queue *q, unsigned char d)
{
    q->queue[q->next_head] = d;
    q->next_head = (q->next_head + 1) % q->capacity;
}

