lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
void EXTI15_10_IRQHandler(void)
{
    __HAL_GPIO_EXTI_CLEAR_IT(KEYBOARD_CLOCK_PIN_MASK);
    NVIC_ClearPendingIRQ(EXTI15_10_IRQn);

    unsigned int keyboard_data_pin = GPIOB->IDR & KEYBOARD_DATA_PIN_MASK;
    unsigned int keyboard_data = keyboard_data_pin ? 1 : 0;

    kbd_data = (kbd_data >> 1) | (keyboard_data << 10);
    kbd_bits++;
    if(kbd_bits == KBD_BIT_COUNT) {
        if(queue_isfull(&kbd_queue.q)) {
            gKeyboardOverflowed = 1;
        } else {
            queue_enq(&kbd_queue.q, (kbd_data >> 1) & 0xff);
        }
        kbd_data = 0;
        kbd_bits = 0;
    }
}


/*--------------------------------------------------------------------------*/
/* USART - serial comms ----------------------------------------------------*/

static UART_HandleTypeDef gUARTHandle;

#define TRANSMIT_BUFFER_SIZE 512
volatile unsigned char gTransmitBuffers[2][TRANSMIT_BUFFER_SIZE];
volatile int gNextTransmitBuffer = 0;
volatile int gTransmitBufferLengths[2] = {0, 0};
volatile int gUARTTransmitBusy = 0;

void USART1_IRQHandler(void)
{
  HAL_UART_IRQHandler(&gUARTHandle);
}

void HAL_UART_MspInit(UART_HandleTypeDef *huart)
{
  GPIO_InitTypeDef  GPIO_InitStruct;
  
  /*##-1- Enable peripherals and GPIO Clocks #################################*/
  /* Enable GPIO TX/RX clock */
  // __HAL_RCC_GPIOB_CLK_ENABLE();
  
  /* Enable USART clock */
  __HAL_RCC_USART1_CLK_ENABLE(); 
  
  /*##-2- Configure peripheral GPIO ##########################################*/  
  /* UART TX GPIO pin configuration  */
  GPIO_InitStruct.Pin       = GPIO_PIN_6;
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull      = GPIO_PULLUP;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
  
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
    
  /* UART RX GPIO pin configuration  */
  GPIO_InitStruct.Pin = GPIO_PIN_7;
  GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
    
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /* NVIC for USART */
  HAL_NVIC_SetPriority(USART1_IRQn, 3, 1);
  HAL_NVIC_EnableIRQ(USART1_IRQn);
}

/**
  * @brief UART MSP De-Initialization 
  *        This function frees the hardware resources used in this example:
  *          - Disable the Peripheral's clock
  *          - Revert GPIO and NVIC configuration to their default state
  * @param huart: UART handle pointer
  * @retval None
  */
void HAL_UART_MspDeInit(UART_HandleTypeDef *huart)
{
  /*##-1- Reset peripherals ##################################################*/
    __HAL_RCC_USART1_FORCE_RESET();
    __HAL_RCC_USART1_RELEASE_RESET();

  /*##-2- Disable peripherals and GPIO Clocks #################################*/
  /* Configure UART Tx as alternate function  */
  HAL_GPIO_DeInit(GPIOB, GPIO_PIN_6);
  /* Configure UART Rx as alternate function  */
  HAL_GPIO_DeInit(GPIOB, GPIO_PIN_7);
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
    gUARTTransmitBusy = 0;
}

void serial_try_to_transmit_buffers()
{
    if(!gUARTTransmitBusy && gTransmitBufferLengths[gNextTransmitBuffer] > 0) {
        gUARTTransmitBusy = 1;

        if(HAL_UART_Transmit_IT(&gUARTHandle, (uint8_t *)&gTransmitBuffers[gNextTransmitBuffer][0], gTransmitBufferLengths[gNextTransmitBuffer]) != HAL_OK) {
            panic();
        }

        gNextTransmitBuffer ^= 1;
        gTransmitBufferLengths[gNextTransmitBuffer] = 0;
    }
}

void serial_flush()
{
    while(gUARTTransmitBusy || gTransmitBufferLengths[gNextTransmitBuffer] > 0)
        serial_try_to_transmit_buffers();
}

void serial_enqueue_one_char(char c)
{
    do {
        // Transmit the current buffer if there is one and serial
        // port is not busy
        serial_try_to_transmit_buffers();

        // While there's no room in the current buffer, repeat until buffer becomes available
    } while(gTransmitBufferLengths[gNextTransmitBuffer] >= TRANSMIT_BUFFER_SIZE);

    int length = gTransmitBufferLengths[gNextTransmitBuffer];
    gTransmitBuffers[gNextTransmitBuffer][length] = c;
    gTransmitBufferLengths[gNextTransmitBuffer]++;
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    panic();
}

volatile char gSerialCharBuffer;
volatile char gStartAnotherUARTReceive = 1;

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    queue_enq(&mon_queue.q, gSerialCharBuffer);
    gStartAnotherUARTReceive = 1;
}

void SERIAL_init()
{
    /*##-1- Configure the UART peripheral ######################################*/
    /* Put the USART peripheral in the Asynchronous mode (UART Mode) */
    /* UART1 configured as follow:
        - Word Length = 8 Bits
        - Stop Bit = One Stop bit
        - Parity = ODD parity
        - BaudRate = 115200 baud
        - Hardware flow control disabled (RTS and CTS signals) */
    gUARTHandle.Instance          = USART1;
    
    gUARTHandle.Init.BaudRate     = 115200;
    gUARTHandle.Init.WordLength   = UART_WORDLENGTH_8B;
    gUARTHandle.Init.StopBits     = UART_STOPBITS_1;
    gUARTHandle.Init.Parity       = UART_PARITY_NONE;
    gUARTHandle.Init.HwFlowCtl    = UART_HWCONTROL_RTS_CTS;
    gUARTHandle.Init.Mode         = UART_MODE_TX_RX;
    gUARTHandle.Init.OverSampling = UART_OVERSAMPLING_16;
      
    if(HAL_UART_Init(&gUARTHandle) != HAL_OK)
    {
      /* Initialization Error */
      panic(); 
    }

    if(HAL_UART_Receive_IT(&gUARTHandle, (uint8_t *)&gSerialCharBuffer, 1) != HAL_OK)
    {
      /* Transfer error in reception process */
      panic();
    }
}

//----------------------------------------------------------------------------
// Alice 3 Bus IO communication protocol

#define IOBOARD_POLL_AGAIN 0x00
#define IOBOARD_SUCCESS 0x01
#define IOBOARD_READY 0x01
#define IOBOARD_FAILURE 0xFF
#define IOBOARD_NOT_READY 0xFF

#define IOBOARD_CMD_NONE  0x00
#define IOBOARD_CMD_MIN  0x01
#define IOBOARD_CMD_READ  0x01
#define IOBOARD_CMD_WRITE 0x02
#define IOBOARD_CMD_CONST 0x03
#define IOBOARD_CMD_CONIN 0x04
#define IOBOARD_CMD_SEROUT 0x05
#define IOBOARD_CMD_READ_SUM 0x06
#define IOBOARD_CMD_WRITE_SUM 0x07
#define IOBOARD_CMD_MAX 0x07

volatile unsigned char command_bytes[1 + 5 + 128 + 2]; // largest is status + write + sector + 16-bit checksum
volatile unsigned char command_length;

