lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
unsigned char gNextByteForReading = IOBOARD_POLL_AGAIN;
volatile unsigned char response_bytes[1 + 128 + 2]; // largest is status + sector + 16-bit checksum
volatile unsigned char response_staging_length;
volatile unsigned char response_length;
volatile unsigned char response_index;
volatile unsigned char response_waiting;
volatile unsigned char gResponseWasWaiting = 0;

void response_start()
{
    response_staging_length = 0;
}

void response_append(unsigned char r)
{
    if(response_staging_length >= sizeof(response_bytes)) {
        printf("PANIC: overflowed response buffer\n");
        panic();
    }
    response_bytes[response_staging_length++] = r;
}

// Caller must protect with disable_interrupts() / enable_interrupts()
void response_finish()
{
    gNextByteForReading = response_bytes[0];
    response_index = 1;
    response_length = response_staging_length;
    response_waiting = 1;
}

// Element 0 is 1 here to force stoppage on receiving a bad command
const unsigned char command_lengths[8] = {1, 6, 134, 1, 1, 2, 6, 136};

// Caller must protect with disable_interrupts()/enable_interrupts() if necessary
void command_clear()
{
    command_length = 0;
}

void BUS_set_DATA(unsigned char data);
void response_clear()
{
    response_length = 0;
    response_index = 0;
    response_waiting = 0;
    gNextByteForReading = IOBOARD_POLL_AGAIN;
    BUS_set_DATA(gNextByteForReading);
}


//----------------------------------------------------------------------------
// Z80 reset button and /RESET signal

#define RESET_BUTTON_PORT GPIOB
#define RESET_BUTTON_PIN_MASK GPIO_PIN_5
#define RESET_BUTTON_IRQn EXTI9_5_IRQn
#define RESET_BUTTON_DELAY_MS 10

#define Z80_RESET_PORT GPIOB
#define Z80_RESET_PIN_MASK GPIO_PIN_0
#define Z80_RESET_ACTIVE 0
#define Z80_RESET_INACTIVE Z80_RESET_PIN_MASK
#define Z80_RESET_DURATION_MS 10

volatile int gZ80IsInRESET = 0;

void BUS_reset_init()
{
    GPIO_InitTypeDef  GPIO_InitStruct;

    GPIO_InitStruct.Pin = Z80_RESET_PIN_MASK;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(Z80_RESET_PORT, &GPIO_InitStruct); 
    HAL_GPIO_WritePin(Z80_RESET_PORT, Z80_RESET_PIN_MASK, Z80_RESET_ACTIVE);
    gZ80IsInRESET = 1;
}

void BUS_reset_start()
{
    HAL_GPIO_WritePin(Z80_RESET_PORT, Z80_RESET_PIN_MASK, Z80_RESET_ACTIVE);
    gZ80IsInRESET = 1;
    delay_ms(Z80_RESET_DURATION_MS);
}

void BUS_reset_finish()
{
    gZ80IsInRESET = 0;
    HAL_GPIO_WritePin(Z80_RESET_PORT, Z80_RESET_PIN_MASK, Z80_RESET_INACTIVE);
}

volatile int gResetTheZ80 = 0;

void RESET_BUTTON_init()
{
    GPIO_InitTypeDef  GPIO_InitStruct;

    GPIO_InitStruct.Pin = RESET_BUTTON_PIN_MASK;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Pull = GPIO_PULLDOWN;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(RESET_BUTTON_PORT, &GPIO_InitStruct); 

    /* Enable and set interrupt priority */
    HAL_NVIC_SetPriority(RESET_BUTTON_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(RESET_BUTTON_IRQn);
}

void EXTI9_5_IRQHandler(void)
{
    __HAL_GPIO_EXTI_CLEAR_IT(RESET_BUTTON_PIN_MASK);
    NVIC_ClearPendingIRQ(RESET_BUTTON_IRQn);

    gResetTheZ80 = 1;
}


//----------------------------------------------------------------------------
// Alice 3 system bus

#define MEMORY_DELAY_MICROS     10
#define IO_DELAY_MICROS     2

// IORQ, RD, WR, and A7 are specially implemented to be on one GPIO register
// in order to quickly determine if IO is being read or written

#define BUS_SIGNAL_CHECK_PORT GPIOC

#define BUS_IORQ_PIN_MASK GPIO_PIN_0
#define BUS_IORQ_PIN 0
#define BUS_IORQ_PORT BUS_SIGNAL_CHECK_PORT
#define BUS_IORQ_ACTIVE 0
#define BUS_IORQ_INACTIVE BUS_IORQ_PIN_MASK

#define BUS_RD_PIN_MASK GPIO_PIN_1
#define BUS_RD_PIN 1
#define BUS_RD_PORT BUS_SIGNAL_CHECK_PORT
#define BUS_RD_ACTIVE 0
#define BUS_RD_INACTIVE BUS_RD_PIN_MASK

#define BUS_WR_PIN_MASK GPIO_PIN_2
#define BUS_WR_PIN 2
#define BUS_WR_PORT BUS_SIGNAL_CHECK_PORT
#define BUS_WR_ACTIVE 0
#define BUS_WR_INACTIVE BUS_WR_PIN_MASK

#define BUS_A7_PIN_MASK GPIO_PIN_4
#define BUS_A7_PORT BUS_SIGNAL_CHECK_PORT

#define BUS_MREQ_PIN_MASK GPIO_PIN_1
#define BUS_MREQ_PIN 1
#define BUS_MREQ_PORT GPIOB
#define BUS_MREQ_ACTIVE 0
#define BUS_MREQ_INACTIVE BUS_MREQ_PIN_MASK

#define BUS_BUSRQ_PIN_MASK GPIO_PIN_11
#define BUS_BUSRQ_PIN 11
#define BUS_BUSRQ_PORT GPIOC
#define BUS_BUSRQ_ACTIVE 0
#define BUS_BUSRQ_INACTIVE BUS_BUSRQ_PIN_MASK

#define BUS_BUSAK_PIN_MASK GPIO_PIN_10
#define BUS_BUSAK_PIN 10
#define BUS_BUSAK_PORT GPIOC
#define BUS_BUSAK_ACTIVE 0
#define BUS_BUSAK_INACTIVE BUS_BUSAK_PIN_MASK

#define BUS_HALT_PIN_MASK GPIO_PIN_15
#define BUS_HALT_PIN 15
#define BUS_HALT_PORT GPIOA

volatile int gZ80IsInHALT = 0;

void BUS_acquire_bus(int releaseReset)
{
    set_GPIO_iotype(BUS_BUSRQ_PORT, BUS_BUSRQ_PIN, GPIO_MODE_OUTPUT_PP);
    set_GPIO_value(BUS_BUSRQ_PORT, BUS_BUSRQ_PIN_MASK, BUS_BUSRQ_ACTIVE);

    if(releaseReset)
        BUS_reset_finish();

    while(HAL_GPIO_ReadPin(BUS_BUSAK_PORT, BUS_BUSAK_PIN_MASK));
}

void BUS_release_bus(int startReset)
{
    set_GPIO_value(BUS_BUSRQ_PORT, BUS_BUSRQ_PIN_MASK, BUS_BUSRQ_INACTIVE);

    if(startReset) {
        BUS_reset_finish();
    } else {
        while(!HAL_GPIO_ReadPin(BUS_BUSAK_PORT, BUS_BUSAK_PIN_MASK));
    }

    set_GPIO_iotype(BUS_BUSRQ_PORT, BUS_BUSRQ_PIN, GPIO_MODE_INPUT);
}

typedef struct GPIOLine {
    GPIO_TypeDef* gpio;
    int pin; 
} GPIOLine;

GPIOLine address_lines[] = {
    {GPIOA, 14}, // A0
    {GPIOA, 13}, // A1
    {GPIOC, 5}, // A2
    {GPIOB, 3}, // A3
    {GPIOB, 10}, // A4
    {GPIOB, 9}, // A5
    {GPIOB, 8}, // A6
    {GPIOC, 4}, // A7
    {GPIOC, 9}, // A8
    {GPIOB, 4}, // A9

#if ALICE3_VERSION == ALICE3_V3

    {GPIOC, 13}, // A10
    {GPIOC, 12}, // A11
    {GPIOC, 8}, // A12
    {GPIOC, 7}, // A13
    {GPIOC, 6}, // A14
    {GPIOC, 3}, // A15

#if ! ALICE3_V3_ARM_IS_RAM

    {GPIOD, 2}, // A16
    {GPIOC, 15}, // A17

#endif // ! ALICE_V3_ARM_IS_RAM

