lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
#endif // ALICE3_VERSION == ALICE3_V3
};
int address_line_count = sizeof(address_lines) / sizeof(address_lines[0]);

unsigned int shuffle_address(unsigned int a)
{
    unsigned int A = 0, B = 0, C = 0;
    for(int i = 0; i < address_line_count; i++) {
        GPIOLine* line = &address_lines[i];
        int bit = (a >> i) & 0x01;
        if(line->gpio == GPIOA)
            A |= (bit << line->pin);
        else if(line->gpio == GPIOB)
            B |= (bit << line->pin);
        else if(line->gpio == GPIOC)
            C |= (bit << line->pin);
    }
    unsigned int ddr = ((A & 0x6000) << 1) | ((B & 0x0700) >> 8) | ((B & 0x0018) << 7) | (C & 0x33F8);
    return ddr;
}

unsigned int BUS_compute_shuffled_ADDRESS(unsigned int A, unsigned int B, unsigned C)
{
    __asm__ volatile("" ::: "memory"); // Force all memory operations before to come before and all after to come after.
    unsigned int address = ((A & 0x6000) << 1) | ((B & 0x0700) >> 8) | ((B & 0x0018) << 7) | (C & 0x33F8);
    return address;
}

unsigned int BUS_get_shuffled_ADDRESS()
{
    unsigned int A = GPIOA->IDR;
    unsigned int B = GPIOB->IDR;
    unsigned int C = GPIOC->IDR;
    __asm__ volatile("" ::: "memory"); // Force all memory operations before to come before and all after to come after.
    unsigned int address = ((A & 0x6000) << 1) | ((B & 0x0700) >> 8) | ((B & 0x0018) << 7) | (C & 0x33F8);
    return address;
}

#define BUS_IO_MASK (BUS_IORQ_PIN_MASK | BUS_RD_PIN_MASK | BUS_WR_PIN_MASK | BUS_A7_PIN_MASK)

#define IO_BOARD_ADDR   0
#define IO_BOARD_ADDR_PINS   (IO_BOARD_ADDR & BUS_A7_PIN_MASK)

const unsigned int gREAD_IO_Signals = BUS_WR_INACTIVE | BUS_IORQ_ACTIVE | BUS_RD_ACTIVE | IO_BOARD_ADDR_PINS;
const unsigned int gWRITE_IO_Signals = BUS_WR_ACTIVE | BUS_IORQ_ACTIVE | BUS_RD_INACTIVE | IO_BOARD_ADDR_PINS;

void BUS_set_DATA_as_input()
{
    GPIOA->MODER = (GPIOA->MODER & ~0xffff) | 0x0;          // INPUT
}

void BUS_set_DATA_as_output()
{
    GPIOA->MODER = (GPIOA->MODER & ~0xffff) | 0x5555;       // OUTPUT
}

unsigned char BUS_get_DATA()
{
    return GPIOA->IDR & 0xff;
}

void BUS_set_DATA(unsigned char data)
{
    GPIOA->ODR = (GPIOA->ODR & ~0xff) | data;
}

// XXX these should be an extern unsigned char[] set through linker
void ccmram_set(unsigned int address, unsigned char b)
{
    ((unsigned char *)0x10000000)[address] = b;
}

unsigned char ccmram_get(unsigned int address)
{
    return ((unsigned char *)0x10000000)[address];
}

int gUnclaimedWrite = 0;
unsigned int gUnclaimedWriteAddress;
unsigned int gUnclaimedWriteData;
int gUnclaimedRead = 0;
unsigned int gUnclaimedReadAddress;
int gReadWasAlreadyInactive = 0;

void EXTI1_IRQHandler(void)
{
    if((BUS_SIGNAL_CHECK_PORT->IDR & BUS_IO_MASK) == gREAD_IO_Signals) {

        // Put this here even before clearing interrupt so it happens
        // as soon as possible.
        BUS_set_DATA(gNextByteForReading);
        BUS_set_DATA_as_output();

        if((BUS_SIGNAL_CHECK_PORT->IDR & BUS_RD_PIN_MASK) == BUS_RD_INACTIVE)
            gReadWasAlreadyInactive = 1;

        __asm__ volatile("" ::: "memory"); // Force all memory operations before to come before and all after to come after.

        while((BUS_SIGNAL_CHECK_PORT->IDR & BUS_RD_PIN_MASK) == BUS_RD_ACTIVE); /* busy wait for RD to rise */
        __asm__ volatile("" ::: "memory"); // Force all memory operations before to come before and all after to come after.
        BUS_set_DATA_as_input();

        __asm__ volatile("" ::: "memory"); // Force all memory operations before to come before and all after to come after.

        __HAL_GPIO_EXTI_CLEAR_IT(BUS_RD_PIN_MASK);
        NVIC_ClearPendingIRQ(EXTI1_IRQn);

        if(response_index >= response_length) {
            response_index = 0;
            response_length = 0;
            response_waiting = 0;
            gNextByteForReading = IOBOARD_POLL_AGAIN;
        } else if(response_length > 0) {
            gNextByteForReading = response_bytes[response_index++];
        } 


    } else if((ALICE3_VERSION == ALICE3_V3) && ALICE3_V3_ARM_IS_RAM &&
        ((BUS_MREQ_PORT->IDR & BUS_MREQ_PIN_MASK) == BUS_MREQ_ACTIVE)) {

        // Memory read if Alice is V3 and ARM is RAM
        unsigned int address = BUS_get_shuffled_ADDRESS();
        unsigned char byte = ccmram_get(address);

        BUS_set_DATA(byte);
        BUS_set_DATA_as_output();

        __asm__ volatile("" ::: "memory"); // Force all memory operations before to come before and all after to come after.

        while((BUS_SIGNAL_CHECK_PORT->IDR & BUS_RD_PIN_MASK) == BUS_RD_ACTIVE); /* busy wait for RD to rise */
        __asm__ volatile("" ::: "memory"); // Force all memory operations before to come before and all after to come after.
        BUS_set_DATA_as_input();

        __asm__ volatile("" ::: "memory"); // Force all memory operations before to come before and all after to come after.

        __HAL_GPIO_EXTI_CLEAR_IT(BUS_RD_PIN_MASK);
        NVIC_ClearPendingIRQ(EXTI1_IRQn);

    } else {

        if((ALICE3_VERSION == ALICE3_V3) && ALICE3_V3_ARM_IS_RAM) {
            gUnclaimedRead = 1;
            gUnclaimedReadAddress = BUS_get_shuffled_ADDRESS();
        }

        __HAL_GPIO_EXTI_CLEAR_IT(BUS_RD_PIN_MASK);
        NVIC_ClearPendingIRQ(EXTI1_IRQn);
    }
}

void EXTI2_IRQHandler(void)
{
    unsigned int initialMREQ = BUS_MREQ_PORT->IDR;
    __asm__ volatile("" ::: "memory"); // Force all memory operations before to come before and all after to come after.
    unsigned char d = BUS_get_DATA();
    __asm__ volatile("" ::: "memory"); // Force all memory operations before to come before and all after to come after.

    if((BUS_IORQ_PORT->IDR & BUS_IORQ_PIN_MASK) == BUS_IORQ_ACTIVE) {

        if((BUS_SIGNAL_CHECK_PORT->IDR & BUS_IO_MASK) == gWRITE_IO_Signals) {
            command_bytes[command_length++] = d;
        }

    } else if((ALICE3_VERSION == ALICE3_V3) && ALICE3_V3_ARM_IS_RAM) {

        __asm__ volatile("" ::: "memory"); // Force all memory operations before to come before and all after to come after.

        unsigned int A = GPIOA->IDR;
        unsigned int B = GPIOB->IDR;
        unsigned int C = GPIOC->IDR;

        __asm__ volatile("" ::: "memory"); // Force all memory operations before to come before and all after to come after.

        // Memory write
        if((initialMREQ & BUS_MREQ_PIN_MASK) == BUS_MREQ_ACTIVE) {
            unsigned int address = BUS_compute_shuffled_ADDRESS(A, B, C);
            ccmram_set(address, d);
        } else {
            gUnclaimedWrite = 1;
            gUnclaimedWriteAddress = BUS_compute_shuffled_ADDRESS(A, B, C);
            gUnclaimedWriteData = d;
        }
    }

    __HAL_GPIO_EXTI_CLEAR_IT(BUS_WR_PIN_MASK);
    NVIC_ClearPendingIRQ(EXTI2_IRQn);
}

void BUS_set_ADDRESS_as_output()
{
    for(int i = 0; i < address_line_count; i++) {
        GPIOLine* line = &address_lines[i];
        set_GPIO_iotype(line->gpio, line->pin, GPIO_MODE_OUTPUT_PP);
    }
}

void BUS_set_ADDRESS_as_input()
{
    for(int i = 0; i < address_line_count; i++) {
        GPIOLine* line = &address_lines[i];
        set_GPIO_iotype(line->gpio, line->pin, GPIO_MODE_INPUT);
    }
}

__attribute__((optimize("unroll-loops")))
void BUS_set_ADDRESS(unsigned int a)
{
    for(int i = 0; i < address_line_count; i++) {
        GPIOLine* line = &address_lines[i];
        set_GPIO_value(line->gpio, 0x1U << line->pin, (a >> i) & 0x01);
    }
}

// Caller has to guarantee A and D access will not collide with
// another peripheral
// Caller has to save and restore D if desired
// Caller has to BUS_start() before and BUS_finish() after
// Caller has to set DATA as output
void BUS_write_memory_byte(unsigned int a, unsigned char d)
{
    BUS_set_ADDRESS(a);
    BUS_set_DATA(d);

    set_GPIO_value(BUS_MREQ_PORT, BUS_MREQ_PIN_MASK, BUS_MREQ_ACTIVE);
    delay_us(1);
    set_GPIO_value(BUS_WR_PORT, BUS_WR_PIN_MASK, BUS_WR_ACTIVE);

    delay_us(MEMORY_DELAY_MICROS);

