lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
        for(unsigned int u = a; u < a + l; u++)
            b[u - a] = ccmram_get(shuffle_address(u));

    } else {

        BUS_mastering_start();
        BUS_set_DATA_as_input();

        for(unsigned int u = a; u < a + l; u++)
            b[u - a] = BUS_read_memory_byte(u);

        BUS_set_DATA(gNextByteForReading);
        BUS_mastering_finish();
    }
}

// Guarantees no collisions through BUSRQ
// another peripheral; basically either Z80 BUSRQ or RESET
void BUS_write_IO(int io, unsigned char byte)
{
    BUS_mastering_start();
    BUS_set_DATA(0);
    BUS_set_DATA_as_output();

    BUS_write_io_byte(io, byte);

    BUS_set_DATA_as_input();
    BUS_set_DATA(gNextByteForReading);
    BUS_mastering_finish();
}


/*--------------------------------------------------------------------------*/
// IO writes

#define VIDEO_BOARD_OUTPUT_ADDR   0x80
#define VIDEO_BOARD_CONTROL_ADDR   0x81
#define VIDEO_BOARD_START_CLOCK   0x01

void VIDEO_output_string(char *c, int inverse)
{
    while(*c) {
        if(*c == '\n') {
            BUS_write_IO(VIDEO_BOARD_OUTPUT_ADDR, '\r');
            BUS_write_IO(VIDEO_BOARD_OUTPUT_ADDR, *c);
        } else
            BUS_write_IO(VIDEO_BOARD_OUTPUT_ADDR, *c + (inverse ? 128 : 0));
        c++;
    }
}

void VIDEO_start_clock()
{
    BUS_mastering_start();
    BUS_set_DATA(0);
    BUS_set_DATA_as_output();

    BUS_write_io_byte(VIDEO_BOARD_OUTPUT_ADDR, VIDEO_BOARD_START_CLOCK);

    BUS_set_DATA_as_input();
    BUS_set_DATA(gNextByteForReading);
    BUS_mastering_finish();
}


//----------------------------------------------------------------------------
// Alice 3 ROM (boot) image

unsigned char *gZ80BootImage;
unsigned int gZ80BootImageLength;

// Caller has to guarantee A and D access will not collide with
// another peripheral; basically either Z80 BUSRQ or RESET
int BUS_write_ROM_image(unsigned char *romimage_bytes, unsigned int romimage_length)
{
    int succeeded = 1;

    if(romimage_bytes == NULL) {
        printf("BUS_write_ROM_image : Z80 boot image is undefined (gZ80BootImage == NULL)\n");
        return 0;
    }

    if((ALICE3_VERSION == ALICE3_V3) && ALICE3_V3_ARM_IS_RAM) {

        for(unsigned int a = 0; a < romimage_length; a++)
            ccmram_set(shuffle_address(a), romimage_bytes[a]);

        for(unsigned int a = 0; a < romimage_length; a++) {
            unsigned char t = ccmram_get(shuffle_address(a));
            if(t != romimage_bytes[a]) {
                printf("BUS_write_ROM_image ccmram: expected 0x%02X byte at RAM address 0x%04X, read 0x%02X\n", romimage_bytes[a], a, t);
                succeeded = 0;
                break;
            }
        }

    } else {

        BUS_mastering_start();

        BUS_set_DATA(0);
        BUS_set_DATA_as_output();

        for(unsigned int a = 0; a < romimage_length; a++)
            BUS_write_memory_byte(a, romimage_bytes[a]);

        BUS_set_DATA_as_input();

        for(unsigned int a = 0; a < romimage_length; a++) {
            unsigned char t = BUS_read_memory_byte(a);
            if(t != romimage_bytes[a]) {
                printf("BUS_write_ROM_image bus : expected 0x%02X byte at RAM address 0x%04X, read 0x%02X\n", romimage_bytes[a], a, t);
                succeeded = 0;
                // break;
            }
        }

        BUS_set_DATA(gNextByteForReading);
        BUS_mastering_finish();

    }

    return succeeded;
}


//----------------------------------------------------------------------------
// reset the Z80 and restore to initial booting state

void Z80_reset()
{
    BUS_reset_start();
    VIDEO_start_clock();

    response_clear();
    command_clear();

    BUS_write_ROM_image(gZ80BootImage, gZ80BootImageLength);

    BUS_reset_finish();
}

//----------------------------------------------------------------------------
// stdio

#define OUTPUT_TO_SERIAL        0x01
#define OUTPUT_TO_VIDEO         0x02

int gOutputDevices = OUTPUT_TO_SERIAL;

void __io_putchar( char c )
{
    if(gOutputDevices & OUTPUT_TO_SERIAL)
        serial_enqueue_one_char(c);
    if(gOutputDevices & OUTPUT_TO_VIDEO) {
        if(c == '\n') // XXX
            BUS_write_IO(VIDEO_BOARD_OUTPUT_ADDR, '\r');
        BUS_write_IO(VIDEO_BOARD_OUTPUT_ADDR, c);
    }
}

void logprintf(int level, char *fmt, ...)
{
    va_list args;
    static char dummy[512];

    if(level > gDebugLevel)
        return;

    va_start(args, fmt);
    vsprintf(dummy, fmt, args);
    va_end(args);
    
    char *s = dummy;
    while(*s) {
        putchar(*s++);
    }
    serial_flush();

    if(!(gOutputDevices & OUTPUT_TO_VIDEO) && (level <= DEBUG_WARNINGS))
        VIDEO_output_string(dummy, 1);
}


/*--------------------------------------------------------------------------*/
/* SD card -----------------------------------------------------------------*/

SPI_HandleTypeDef gSPIHandle;

void HAL_SPI_MspInit(SPI_HandleTypeDef *hspi)
{
    GPIO_InitTypeDef  GPIO_InitStruct;

    /* Enable GPIO CK/TX/RX clocks */
    // __HAL_RCC_GPIOB_CLK_ENABLE();
    /* Enable SPI clock */
    __HAL_RCC_SPI2_CLK_ENABLE();

    /*##-2- Configure peripheral GPIO ##########################################*/

    // Alternate function SPI2, high speed, push-pull
    GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_MEDIUM;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;

    /* SPI SCK GPIO pin configuration  */
    GPIO_InitStruct.Pin       = GPIO_PIN_13;
    GPIO_InitStruct.Pull      = GPIO_NOPULL; // GPIO_PULLUP;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* SPI MISO GPIO pin configuration  */
    GPIO_InitStruct.Pin = GPIO_PIN_14;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL; // GPIO_PULLUP;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* SPI MOSI GPIO pin configuration  */
    GPIO_InitStruct.Pin = GPIO_PIN_15;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL; // GPIO_PULLUP;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
}

void HAL_SPI_MspDeInit(SPI_HandleTypeDef *hspi)
{
    /*##-1- Reset peripherals ##################################################*/
    __HAL_RCC_SPI2_FORCE_RESET();
    __HAL_RCC_SPI2_RELEASE_RESET();

    /*##-2- Disable peripherals and GPIO Clocks ################################*/
    /* Configure SPI SCK as alternate function  */
    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_13);
    /* Configure SPI MISO as alternate function  */
    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_14);
    /* Configure SPI MOSI as alternate function  */
    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_15);
}

#define SPI_SS_PIN_MASK      GPIO_PIN_8
#define SPI_SS_PORT     GPIOA

void SPI_enable_sd()
{
    HAL_GPIO_WritePin(SPI_SS_PORT, SPI_SS_PIN_MASK, 0);     // SS true
    delay_ms(100);
}

void SPI_disable_sd()
{
    HAL_GPIO_WritePin(SPI_SS_PORT, SPI_SS_PIN_MASK, 1);     // SS false
    delay_ms(100);
}

// Postcondition: SPI configured for SD, SS high (false)
void SPI_config_for_sd()
{
    GPIO_InitTypeDef  GPIO_InitStruct;

