lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
    gSPIHandle.Instance               = SPI2;

    // SPI2 is APB1, which is 1/4 system clock, or at 168MHz, APB1 is
    // 42MHz.  INit should be at  100KHz - 400 KHz, 128 will be 328.124Khz
    gSPIHandle.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_256;
    gSPIHandle.Init.Direction         = SPI_DIRECTION_2LINES;
    gSPIHandle.Init.CLKPhase          = SPI_PHASE_2EDGE;
    gSPIHandle.Init.CLKPolarity       = SPI_POLARITY_HIGH;
    gSPIHandle.Init.CRCCalculation    = SPI_CRCCALCULATION_DISABLE;
    gSPIHandle.Init.CRCPolynomial     = 7;
    gSPIHandle.Init.DataSize          = SPI_DATASIZE_8BIT;
    gSPIHandle.Init.FirstBit          = SPI_FIRSTBIT_MSB;
    gSPIHandle.Init.NSS               = SPI_NSS_SOFT;
    gSPIHandle.Init.TIMode            = SPI_TIMODE_DISABLE;
    gSPIHandle.Init.Mode              = SPI_MODE_MASTER;

    if(HAL_SPI_Init(&gSPIHandle) != HAL_OK)
    {
        printf("failed to initialize SPI\n");
        panic();
    }

    // SD /CS card select, slave select /SS
    GPIO_InitStruct.Pin = SPI_SS_PIN_MASK;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH; // XXX change to match SPI rate?
    HAL_GPIO_Init(SPI_SS_PORT, &GPIO_InitStruct); 
    SPI_disable_sd();
}


/*--------------------------------------------------------------------------*/
/* SD card -----------------------------------------------------------------*/

unsigned char crc7_add_byte(unsigned char data, unsigned char previous_crc)
{
    unsigned char crc = previous_crc;
    int b;

    for (b = 0; b < 8; b++) {
        unsigned int crcbit = crc & 0x40;

        if ((data & 0x80UL) != 0)
            crcbit ^= 0x40;

        data <<= 1;
        crc <<= 1;

        if (crcbit != 0)
            crc ^= 0x09;
    }

    return crc;
}

unsigned char crc7_generate_bytes(unsigned char *b, int count)
{
    unsigned char crc = 0;
    int i;

    for(i = 0; i < count; i++)
        crc = crc7_add_byte(b[i], crc);

    return crc;
}

/* Linux 2.6.32 crc-itu-t.c */
/** CRC table for the CRC ITU-T V.41 0x0x1021 (x^16 + x^12 + x^15 + 1) */
const unsigned short crc_itu_t_table[256] = {
    0x0000, 0x1021, 0x2042, 0x3063, 0x4084, 0x50a5, 0x60c6, 0x70e7,
    0x8108, 0x9129, 0xa14a, 0xb16b, 0xc18c, 0xd1ad, 0xe1ce, 0xf1ef,
    0x1231, 0x0210, 0x3273, 0x2252, 0x52b5, 0x4294, 0x72f7, 0x62d6,
    0x9339, 0x8318, 0xb37b, 0xa35a, 0xd3bd, 0xc39c, 0xf3ff, 0xe3de,
    0x2462, 0x3443, 0x0420, 0x1401, 0x64e6, 0x74c7, 0x44a4, 0x5485,
    0xa56a, 0xb54b, 0x8528, 0x9509, 0xe5ee, 0xf5cf, 0xc5ac, 0xd58d,
    0x3653, 0x2672, 0x1611, 0x0630, 0x76d7, 0x66f6, 0x5695, 0x46b4,
    0xb75b, 0xa77a, 0x9719, 0x8738, 0xf7df, 0xe7fe, 0xd79d, 0xc7bc,
    0x48c4, 0x58e5, 0x6886, 0x78a7, 0x0840, 0x1861, 0x2802, 0x3823,
    0xc9cc, 0xd9ed, 0xe98e, 0xf9af, 0x8948, 0x9969, 0xa90a, 0xb92b,
    0x5af5, 0x4ad4, 0x7ab7, 0x6a96, 0x1a71, 0x0a50, 0x3a33, 0x2a12,
    0xdbfd, 0xcbdc, 0xfbbf, 0xeb9e, 0x9b79, 0x8b58, 0xbb3b, 0xab1a,
    0x6ca6, 0x7c87, 0x4ce4, 0x5cc5, 0x2c22, 0x3c03, 0x0c60, 0x1c41,
    0xedae, 0xfd8f, 0xcdec, 0xddcd, 0xad2a, 0xbd0b, 0x8d68, 0x9d49,
    0x7e97, 0x6eb6, 0x5ed5, 0x4ef4, 0x3e13, 0x2e32, 0x1e51, 0x0e70,
    0xff9f, 0xefbe, 0xdfdd, 0xcffc, 0xbf1b, 0xaf3a, 0x9f59, 0x8f78,
    0x9188, 0x81a9, 0xb1ca, 0xa1eb, 0xd10c, 0xc12d, 0xf14e, 0xe16f,
    0x1080, 0x00a1, 0x30c2, 0x20e3, 0x5004, 0x4025, 0x7046, 0x6067,
    0x83b9, 0x9398, 0xa3fb, 0xb3da, 0xc33d, 0xd31c, 0xe37f, 0xf35e,
    0x02b1, 0x1290, 0x22f3, 0x32d2, 0x4235, 0x5214, 0x6277, 0x7256,
    0xb5ea, 0xa5cb, 0x95a8, 0x8589, 0xf56e, 0xe54f, 0xd52c, 0xc50d,
    0x34e2, 0x24c3, 0x14a0, 0x0481, 0x7466, 0x6447, 0x5424, 0x4405,
    0xa7db, 0xb7fa, 0x8799, 0x97b8, 0xe75f, 0xf77e, 0xc71d, 0xd73c,
    0x26d3, 0x36f2, 0x0691, 0x16b0, 0x6657, 0x7676, 0x4615, 0x5634,
    0xd94c, 0xc96d, 0xf90e, 0xe92f, 0x99c8, 0x89e9, 0xb98a, 0xa9ab,
    0x5844, 0x4865, 0x7806, 0x6827, 0x18c0, 0x08e1, 0x3882, 0x28a3,
    0xcb7d, 0xdb5c, 0xeb3f, 0xfb1e, 0x8bf9, 0x9bd8, 0xabbb, 0xbb9a,
    0x4a75, 0x5a54, 0x6a37, 0x7a16, 0x0af1, 0x1ad0, 0x2ab3, 0x3a92,
    0xfd2e, 0xed0f, 0xdd6c, 0xcd4d, 0xbdaa, 0xad8b, 0x9de8, 0x8dc9,
    0x7c26, 0x6c07, 0x5c64, 0x4c45, 0x3ca2, 0x2c83, 0x1ce0, 0x0cc1,
    0xef1f, 0xff3e, 0xcf5d, 0xdf7c, 0xaf9b, 0xbfba, 0x8fd9, 0x9ff8,
    0x6e17, 0x7e36, 0x4e55, 0x5e74, 0x2e93, 0x3eb2, 0x0ed1, 0x1ef0
};

unsigned short crc_itu_t_byte(unsigned short crc, const unsigned char data)
{
    return (crc << 8) ^ crc_itu_t_table[((crc >> 8) ^ data) & 0xff];
}

/**
 * crc_itu_t - Compute the CRC-ITU-T for the data buffer
 *
 * @crc:     previous CRC value
 * @buffer:  data pointer
 * @len:     number of bytes in the buffer
 *
 * Returns the updated CRC value
 */
unsigned short crc_itu_t(unsigned short crc, const unsigned char *buffer, size_t len)
{
    while (len--)
        crc = crc_itu_t_byte(crc, *buffer++);
    return crc;
}

int gSDCardTimeoutMillis = 1000;

#define BLOCK_SIZE 512

int gCachedBlockNumber = 0xffff;
unsigned char gCachedBlock[BLOCK_SIZE];

// cribbed somewhat from http://elm-chan.org/docs/mmc/mmc_e.html
enum SDCardCommand {
    CMD0 = 0,    // init; go to idle state
    CMD8 = 8,    // send interface condition
    CMD17 = 17,  // read single block
    CMD24 = 24,  // write single block
    CMD55 = 55,  // prefix command for application command
    ACMD41 = 41, // application command to send operating condition
};
const unsigned char gSDCardResponseIDLE = 0x01;
const unsigned char gSDCardResponseSUCCESS = 0x00;
const unsigned char gSDCardResponseDATA_ACCEPTED = 0xE5;
const unsigned char gSDCardToken_17_18_24 = 0xFE;

void spi_bulk(unsigned char *buffer, unsigned int nlen)
{
    if(gDebugLevel >= DEBUG_INSANE) {
        printf("spi_bulk write:\n");
        dump_buffer_hex(4, buffer, nlen);
    }
    int result = HAL_SPI_TransmitReceive(&gSPIHandle, buffer, buffer, nlen, 1000);
    if(result != HAL_OK){
        printf("spi_bulk: SPI error 0x%04X\n", result);
        panic();
    }
    if(gDebugLevel >= DEBUG_INSANE) {
        printf("spi_bulk read:\n");
        dump_buffer_hex(4, buffer, nlen);
    }
}

void spi_writen(const unsigned char *buffer, unsigned int nlen)
{
    if(gDebugLevel >= DEBUG_INSANE) {
        printf("spi_writen write:\n");
        dump_buffer_hex(4, buffer, nlen);
    }
    int result = HAL_SPI_Transmit(&gSPIHandle, (unsigned char *)buffer, nlen, 1000);
    if(result != HAL_OK){
        logprintf(DEBUG_ERRORS, "spi_writen: SPI error 0x%04X\n", result);
        panic();
    }
}

void spi_readn(unsigned char *buffer, unsigned int nlen)
{
    memset(buffer, 0xff, nlen);
    int result = HAL_SPI_TransmitReceive(&gSPIHandle, buffer, buffer, nlen, 1000);
    if(result != HAL_OK){
        logprintf(DEBUG_ERRORS, "spi_readn: SPI error 0x%04X\n", result);
        panic();
    }
    if(gDebugLevel >= DEBUG_INSANE) {
        printf("spi_readn read:\n");
        dump_buffer_hex(4, buffer, nlen);
    }
}

