lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
    // Get DATA_ACCEPTED response from WRITE
    spi_readn(response, 1);
    logprintf(DEBUG_DATA, "writeblock response 0x%02X\n", response[0]);
    if(response[0] != gSDCardResponseDATA_ACCEPTED) {
        logprintf(DEBUG_ERRORS, "sdcard_writeblock: failed to respond with DATA_ACCEPTED, response was 0x%02X\n", response[0]);
        return 0;
    }

    // Wait while busy (DO = low).
    int then = HAL_GetTick();
    count = 0;
    do {
        int now = HAL_GetTick();
        if(now - then > gSDCardTimeoutMillis) {
            logprintf(DEBUG_ERRORS, "sdcard_writeblock: timed out waiting on completion\n");
            panic();
        }
        spi_readn(response, 1);
        logprintf(DEBUG_ALL, "writeblock completion 0x%02X\n", response[0]);
        count++;
    } while(response[0] != 0xFF);
    logprintf(DEBUG_DATA, "read %d SPI bytes waiting on write to complete.\n", count);

    if(gDebugLevel >= DEBUG_ALL) dump_more_spi_bytes("write completion");

    return 1;
}

void test_sd_card()
{
    int i;
    int success;
    int block_number;
    static unsigned char original_block[BLOCK_SIZE];

    // test SD card
    block_number = 0;

    for(;;) {
        printf("block %d\n", block_number);
        // printf("Reading a block\n");
        if(!sdcard_readblock(block_number, original_block)) {
            panic();
        }
        // printf("Original block:\n");
        // dump_buffer_hex(4, original_block, BLOCK_SIZE);

        for(i = 0; i < BLOCK_SIZE; i++)
            gCachedBlock[i] = (original_block[i] + 0x55) % 256;

        if(!sdcard_writeblock(block_number, gCachedBlock)) {
            printf("PANIC: Failed writeblock\n");
            panic();
        }
        // printf("Wrote junk block\n");

        for(i = 0; i < BLOCK_SIZE; i++)
            gCachedBlock[i] = 0;
        if(!sdcard_readblock(block_number, gCachedBlock)) {
            printf("PANIC: Failed readblock\n");
            panic();
        }

        success = 1;
        for(i = 0; i < BLOCK_SIZE; i++)
            if(gCachedBlock[i] != (original_block[i] + 0x55) % 256)
                success = 0;

        if(!success) {
            printf("whoops, error verifying write of junk to block 0\n");
            printf("block read: %02X %02X %02X %02X\n",
                gCachedBlock[0], gCachedBlock[1], gCachedBlock[2], gCachedBlock[3]);
        } else {
            printf("Verified junk block was written\n");
        }

        if(!sdcard_writeblock(block_number, original_block)) {
            printf("PANIC: Failed writeblock\n");
            panic();
        }
        // printf("Wrote original block\n");

        if(!sdcard_readblock(block_number, gCachedBlock)) {
            printf("PANIC: Failed readblock\n");
            panic();
        }

        success = 1;
        for(i = 0; i < BLOCK_SIZE; i++)
            if(original_block[i] != gCachedBlock[i])
                success = 0;

        if(!success) {
            printf("whoops, error verifying write of original to block 0\n");
            printf("block read: %02X %02X %02X %02X\n",
                gCachedBlock[0], gCachedBlock[1], gCachedBlock[2], gCachedBlock[3]);
        } else {
            printf("Verified original block was written\n");
        }
        block_number ++;
    }
}


//----------------------------------------------------------------------------
// FatFS device routines

DSTATUS disk_status (BYTE pdrv)
{
    if(pdrv != 0)
        return STA_NODISK;

    return 0;
}

DSTATUS disk_initialize (BYTE pdrv)
{
    if(pdrv != 0)
        return RES_ERROR;

    return RES_OK;
}

DRESULT disk_read (BYTE pdrv, BYTE *buff, DWORD sector,	UINT count)
{
    if(pdrv != 0)
        return RES_ERROR;

    for(int i = 0; i < count; i++)
        if(!sdcard_readblock(sector + i, buff + BLOCK_SIZE * i))  {
            logprintf(DEBUG_ERRORS, "ERROR: failed reading SD block %d\n", sector + i);
            return RES_ERROR;
        }
    
    return RES_OK;
}

DRESULT disk_write (BYTE pdrv, const BYTE *buff, DWORD sector, UINT count)
{
    if(pdrv != 0)
        return RES_ERROR;

    for(int i = 0; i < count; i++)
        if(!sdcard_writeblock(sector + i, buff + BLOCK_SIZE * i)) {
            logprintf(DEBUG_ERRORS, "ERROR: failed reading SD block %d\n", sector + i);
            return RES_ERROR;
        }
    
    return RES_OK;
}

DRESULT disk_ioctl (BYTE pdrv, BYTE cmd, void *buff)
{
    DRESULT result = RES_OK;

    if(pdrv != 0)
        return RES_ERROR;

    switch(cmd) {
        case CTRL_SYNC:
            result = RES_OK;
            break;

        default:
            logprintf(DEBUG_ERRORS, "ERROR: unexpected FatFS ioctl %d\n", cmd);
            result = RES_ERROR;
            break;
    }

    return result;
}

DWORD get_fattime(void)
{
    // returns FatFS formatted date-time
    // hardcoded to Mar 15 2016, midnight
    return
        ((_NORTC_YEAR - 1980) << 25) | 
        (_NORTC_MON << 21) | 
        (_NORTC_MDAY << 16) | 
        (0 << 11) | 
        (0 << 5) | 
        (0 << 0)
        ;
}

//----------------------------------------------------------------------------
// CP/M 8MB Disk definitions


#define SECTORS_PER_BLOCK 4
#define SECTORS_PER_TRACK 64
#define TRACKS_PER_DISK 1024
#define SECTOR_SIZE 128
/* disk is 8MB, so 16384 512-byte blocks per disk */
#define BLOCKS_PER_DISK 16384

FATFS gFATVolume;

#define DISK_IMAGE_MAX 8
char gDiskImageFilenames[DISK_IMAGE_MAX][13];
FIL gDiskImageFiles[DISK_IMAGE_MAX];
int gDiskImageCount = 0;

int read_disk_image_list()
{
    FIL f;
    FRESULT result = f_open (&f, "disks.txt", FA_READ | FA_OPEN_EXISTING);

    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't open \"disks.txt\" for reading, FatFS result %d\n", result);
        return 0;
    }

    while(!f_eof(&f) && (gDiskImageCount < DISK_IMAGE_MAX)) {
        static char line[80];
        if(f_gets(line, sizeof(line), &f)) {
            if(line[strlen(line) - 1] != '\n') {
                logprintf(DEBUG_WARNINGS, "\"disks.txt\" unexpectedly contained a line longer than 80 characters:\n");
                logprintf(DEBUG_WARNINGS, "\"%s\"\n", line);
                return 0;
            }

            line[strlen(line) - 1] = '\0';

            if(strlen(line) > 12) {
                logprintf(DEBUG_WARNINGS, "Unexpectedly long disk image name \"%s\" ignored\n", line);
            } else {
                strcpy(gDiskImageFilenames[gDiskImageCount], line);
                gDiskImageCount++;
            }
        }
    }

