lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
    if(!f_eof(&f)) {
        logprintf(DEBUG_WARNINGS, "Maximum disk images reached (%d), further contents of \"disks.txt\" ignored\n", DISK_IMAGE_MAX);
    }

    f_close(&f);
    return 1;
}

int open_disk_images()
{
    int success = 1;
    int i;

    for(i = 0; i < gDiskImageCount; i++) {
        FRESULT result = f_open (&gDiskImageFiles[i], gDiskImageFilenames[i], FA_READ | FA_WRITE | FA_OPEN_EXISTING);

        if(result != FR_OK) {
            logprintf(DEBUG_ERRORS, "ERROR: couldn't open disk image \"%s\" for rw, FatFS result %d\n", gDiskImageFilenames[i], result);
            success = 0;
            break;
        }

        if(f_size(&gDiskImageFiles[i]) != BLOCKS_PER_DISK * BLOCK_SIZE) {
            logprintf(DEBUG_ERRORS, "ERROR: expected disk image \"%s\" to be 8MB, is %d bytes\n", gDiskImageFilenames[i], f_size(&gDiskImageFiles[i]));
            success = 0;
            break;
        }
    }

    if(!success)
        for(int j = 0; j < i; j++)
            f_close(&gDiskImageFiles[j]);

    return success;
}

char gMonitorCommandLine[80];
unsigned char gMonitorCommandLineLength = 0;

void usage()
{
    printf("help       - this help message\n");
    printf("debug N    - set debug level\n");
    printf("buffers    - print summary of command and response buffers\n");
    printf("reset      - reset Z80 and clear communication buffers\n");
    printf("sdreset    - reset SD\n");
    printf("sdss {0|1} - 1: enable SD (SS=GND), 0: disable SD (SS=3.3V)\n");
    printf("spiwrite B0 [B1 ...]\n");
    printf("           - send bytes to SD SPI port and print read bytes\n");
    printf("spiread N  - read N bytes from SD SPI port\n");
    printf("dumpkbd    - toggle dumping keyboard\n");
    printf("pass       - pass monitor keys to Z80\n");
    printf("version    - print firmware build version\n");
    printf("read N     - read and dump block N\n");
    printf("low128     - dump low 128 bytes from RAM (resetting Z80!!)\n");
    printf("bus        - print bus signals\n");
    printf("panic      - force panic\n");
    printf("flashinfo  - force flashing the info LED\n");
}

#define IOBOARD_FIRMWARE_VERSION_STRING XSTR(IOBOARD_FIRMWARE_VERSION)

volatile unsigned char gSerialInputToMonitor = 1;

void process_local_key(unsigned char c)
{
    // XXX make this table driven, break into lots smaller functions
    if(c == '\r' || c == '\n') {
        putchar('\n');
        gMonitorCommandLine[gMonitorCommandLineLength] = 0;

        if((strcmp(gMonitorCommandLine, "help") == 0) ||
           (strcmp(gMonitorCommandLine, "h") == 0) ||
           (strcmp(gMonitorCommandLine, "?") == 0)) {

            usage();

        } else if(strcmp(gMonitorCommandLine, "sdreset") == 0) {

            printf("Resetting SD card...\n");

            if(!sdcard_init())
                printf("Failed to start access to SD card as SPI\n");

        } else if(strcmp(gMonitorCommandLine, "dumpkbd") == 0) {

            dump_keyboard_data = !dump_keyboard_data;
            if(dump_keyboard_data)
                printf("Dumping keyboard data...\n");
            else
                printf("Not dumping keyboard data...\n");

        } else if(strcmp(gMonitorCommandLine, "flashinfo") == 0) {

            for(int i = 0; i < 8; i++) {
                LED_set_info(1);
                delay_ms(125);
                LED_set_info(0);
                delay_ms(125);
            }

        } else if(strcmp(gMonitorCommandLine, "panic") == 0) {

            printf("panicking now\n");
            panic();

        } else if(strcmp(gMonitorCommandLine, "bus") == 0) {

            printf("RESET %s\n", HAL_GPIO_ReadPin(Z80_RESET_PORT, Z80_RESET_PIN_MASK) ? "high" : "low");
            printf("HALT %s\n", HAL_GPIO_ReadPin(BUS_HALT_PORT, BUS_HALT_PIN_MASK) ? "high" : "low");
            printf("IORQ %s\n", HAL_GPIO_ReadPin(BUS_IORQ_PORT, BUS_IORQ_PIN_MASK) ? "high" : "low");
            printf("MREQ %s\n", HAL_GPIO_ReadPin(BUS_MREQ_PORT, BUS_MREQ_PIN_MASK) ? "high" : "low");
            printf("RD %s\n", HAL_GPIO_ReadPin(BUS_RD_PORT, BUS_RD_PIN_MASK) ? "high" : "low");
            printf("WR %s\n", HAL_GPIO_ReadPin(BUS_WR_PORT, BUS_WR_PIN_MASK) ? "high" : "low");
            printf("BUSRQ %s\n", HAL_GPIO_ReadPin(BUS_BUSRQ_PORT, BUS_BUSRQ_PIN_MASK) ? "high" : "low");
            printf("BUSAK %s\n", HAL_GPIO_ReadPin(BUS_BUSAK_PORT, BUS_BUSAK_PIN_MASK) ? "high" : "low");

        } else if(strncmp(gMonitorCommandLine, "chaff ", 6) == 0) {

            char *p = gMonitorCommandLine + 5;
            while(*p == ' ')
                p++;
            int addr = strtol(p, NULL, 0);

            BUS_mastering_start();
            BUS_set_DATA_as_input();
            BUS_set_ADDRESS(addr);
            set_GPIO_value(BUS_MREQ_PORT, BUS_MREQ_PIN_MASK, BUS_MREQ_ACTIVE);
            delay_us(1);
            set_GPIO_value(BUS_RD_PORT, BUS_RD_PIN_MASK, BUS_RD_ACTIVE);
            delay_us(1);

        } else if(strcmp(gMonitorCommandLine, "low128") == 0) {

            BUS_reset_start();

            static unsigned char buf[128];
            BUS_read_memory_block(0, 128, buf);

            printf("low 128 bytes of RAM:\n");
            dump_buffer_hex(4, buf, sizeof(buf));

            // BUS_reset_finish();

        } else if(strcmp(gMonitorCommandLine, "reset") == 0) {

            printf("Resetting Z-80 and communication buffers...\n");
            Z80_reset();

        } else if(strcmp(gMonitorCommandLine, "pass") == 0) {

            gSerialInputToMonitor = 0;
            printf("Press CTRL-A then CTRL-B to return to monitor.\n");

        } else if(strcmp(gMonitorCommandLine, "buffers") == 0) {

            printf("Command length: %d bytes\n", command_length);
            if(command_length > 0) {
                printf("Command buffer:\n");
                dump_buffer_hex(4, (unsigned char *)command_bytes, command_length);
            }

            printf("Response length: %d bytes\n", response_length);
            printf("Response next byte to put on bus: %d\n", response_index);
            if(response_length > 0) {
                printf("Response buffer:\n");
                dump_buffer_hex(4, (unsigned char *)response_bytes, response_length);
            }

        } else if(strcmp(gMonitorCommandLine, "version") == 0) {

