lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
            printf("%s\n", IOBOARD_FIRMWARE_VERSION_STRING);

        } else if(strncmp(gMonitorCommandLine, "debug ", 6) == 0) {

            char *p = gMonitorCommandLine + 5;
            while(*p == ' ')
                p++;
            gDebugLevel = strtol(p, NULL, 0);
            printf("Debug level set to %d\n", gDebugLevel);

        } else if(strncmp(gMonitorCommandLine, "spiwrite ", 9) == 0) {

            char *endptr = gMonitorCommandLine + 9;
            char *p;
            int count = 0;
            unsigned char buffer[16];
            do {
                p = endptr;
                buffer[count] = strtol(p, &endptr, 0);
                if(p != endptr)
                    count++;
            } while(endptr != p);
            printf("Writing %d bytes\n", count);
            dump_buffer_hex(4, buffer, count);

            spi_bulk(buffer, count);

            if(count == 1) {
                printf("Byte returned: 0x%02X\n", buffer[0]);
            } else {
                printf("Bytes returned:\n");
                dump_buffer_hex(4, buffer, count);
            }

        } else if(strncmp(gMonitorCommandLine, "spiread ", 8) == 0) {

            char *p = gMonitorCommandLine + 8;
            while(*p == ' ')
                p++;
            int count = strtol(p, NULL, 0);
            unsigned char buffer[16];
            if(count > sizeof(buffer)) {
                printf("count %d is larger than available buffer, truncating to %d\n", count, sizeof(buffer));
                count = sizeof(buffer);
            }
            spi_readn(buffer, count);
            if(count == 1) {
                printf("Byte returned: 0x%02X\n", buffer[0]);
            } else {
                printf("Bytes returned:\n");
                dump_buffer_hex(4, buffer, count);
            }

        } else if(strncmp(gMonitorCommandLine, "sdss ", 5) == 0) {

            char *p = gMonitorCommandLine + 4;
            while(*p == ' ')
                p++;
            int ss = strtol(p, NULL, 0);
            if(ss) {
                SPI_enable_sd();
                printf("/SS to SD card is enabled (GND)\n");
            } else {
                SPI_disable_sd();
                printf("/SS to SD card is disabled (+3.3V)\n");
            }

        } else if(strncmp(gMonitorCommandLine, "read ", 5) == 0) {

            char *p = gMonitorCommandLine + 4;
            while(*p == ' ')
                p++;
            gCachedBlockNumber = strtol(p, NULL, 0);
            if(sdcard_readblock(gCachedBlockNumber, gCachedBlock)) {
                dump_buffer_hex(4, gCachedBlock, BLOCK_SIZE);
            }

        } else {

            printf("Unknown command.\n");
            usage();
        }

        printf("* ");
        gMonitorCommandLineLength = 0;

    } else {

        if(c == 127 || c == '\b') {
            if(gMonitorCommandLineLength > 0) {
                putchar('\b');
                putchar(' ');
                putchar('\b');
                gMonitorCommandLineLength--;
            } else {
                bell();
            }
        } else {
            if(gMonitorCommandLineLength < sizeof(gMonitorCommandLine) - 1) {
                putchar(c);
                gMonitorCommandLine[gMonitorCommandLineLength++] = c;
            } else {
                bell();
            }
        }
    // TODO - upload data, write block
    }
}


void process_command_read(unsigned char command_request, volatile unsigned char *command_bytes)
{
    static unsigned char buffer[128];
    unsigned int disk = command_bytes[1];
    unsigned int sector = command_bytes[2] + 256 * command_bytes[3];
    unsigned int track = command_bytes[4] + 256 * command_bytes[5];
    unsigned int lba_sector = track * SECTORS_PER_TRACK + sector;

    logprintf(DEBUG_EVENTS, "read disk %d, sector %d, track %d, lba sector %d\n", disk, sector, track, lba_sector);

    if(disk > gDiskImageCount) { 
        logprintf(DEBUG_WARNINGS, "asked for disk out of range\n");
        response_append(IOBOARD_FAILURE);
        return;
    }

    FRESULT result = f_lseek(&gDiskImageFiles[disk], lba_sector * SECTOR_SIZE);
    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't seek to sector %d, track %d in \"%s\", FatFS result %d\n", sector, track, gDiskImageFilenames[disk], result);
        response_append(IOBOARD_FAILURE);
        return;
    }

    UINT wasread;
    result = f_read(&gDiskImageFiles[disk], buffer, SECTOR_SIZE, &wasread);
    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't read sector %d, track %d from \"%s\", FatFS result %d\n", sector, track, gDiskImageFilenames[disk], result);
        response_append(IOBOARD_FAILURE);
        return;
    }
    if(wasread != SECTOR_SIZE) {
        logprintf(DEBUG_ERRORS, "ERROR: tried to read %lu bytes from sector %d, track %d of \"%s\", only read %ld\n", SECTOR_SIZE, gDiskImageFilenames[disk], sector, track, wasread);
        response_append(IOBOARD_FAILURE);
        return;
    }
    if(gDebugLevel >= DEBUG_ALL) dump_buffer_hex(4, buffer, SECTOR_SIZE);

    response_append(IOBOARD_SUCCESS);

    for(unsigned int u = 0; u < SECTOR_SIZE; u++)
        response_append(buffer[u]);

    if(command_request == IOBOARD_CMD_READ_SUM) {
        unsigned short sum = 0;

        for(unsigned int u = 0; u < SECTOR_SIZE; u++)
            sum += buffer[u];

        response_append(sum & 0xff);
        response_append((sum >> 8) & 0xff);
        logprintf(DEBUG_ALL, "checksum calculated as %u: 0x%02X then 0x%02X\n", sum, sum & 0xff, (sum >> 8) & 0xff);
    }
}

void process_command_write(unsigned char command_request, volatile unsigned char *command_bytes)
{
    unsigned int disk = command_bytes[1];
    unsigned int sector = command_bytes[2] + 256 * command_bytes[3];
    unsigned int track = command_bytes[4] + 256 * command_bytes[5];
    unsigned int lba_sector = track * SECTORS_PER_TRACK + sector;

    logprintf(DEBUG_EVENTS, "write disk %d, sector %d, track %d, lba sector %d\n", disk, sector, track, lba_sector);

    if(disk > gDiskImageCount) { 
        logprintf(DEBUG_WARNINGS, "asked for disk out of range\n");
        response_append(IOBOARD_FAILURE);
        return;
    }

    if(command_request == IOBOARD_CMD_WRITE_SUM) {
        unsigned short sum = 0;
        unsigned char offset = 6;
        for(unsigned int u = 0; u < SECTOR_SIZE; u++)
            sum += command_bytes[offset + u];
        unsigned short theirs = command_bytes[134] | (command_bytes[135] << 8);
        if(sum != theirs) {
            logprintf(DEBUG_WARNINGS, "WARNING: IOBOARD_CMD_WRITE_SUM checksum does not match\n");
            // XXX retry?
            response_append(IOBOARD_FAILURE);
            return;
        }
    }

    FRESULT result = f_lseek(&gDiskImageFiles[disk], lba_sector * SECTOR_SIZE);
    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't seek to sector %d, track %d in \"%s\", FatFS result %d\n", sector, track, gDiskImageFilenames[disk], result);
        panic();
    }

    UINT waswritten;
    result = f_write(&gDiskImageFiles[disk], (unsigned char*)(command_bytes + 6), SECTOR_SIZE, &waswritten);
    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't write to sector %d, track %d in \"%s\", FatFS result %d\n", sector, track, gDiskImageFilenames[disk], result);
        response_append(IOBOARD_FAILURE);
        return;
    }
    if(waswritten != SECTOR_SIZE) {
        logprintf(DEBUG_ERRORS, "ERROR: tried to write %lu bytes to sector %d, track %d of \"%s\", only read %ld\n", SECTOR_SIZE, gDiskImageFilenames[disk], sector, track, waswritten);
        response_append(IOBOARD_FAILURE);
        return;
    }
    // XXX Should probably set this up as a timeout, so multiple
    // sectors writes can take advantage of single block
    f_sync(&gDiskImageFiles[disk]);

    response_append(IOBOARD_SUCCESS);
}

