lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
void check_and_process_command()
{
    unsigned char isEmpty;

    if(command_length == 0)
        return;

    unsigned char command = command_bytes[0];

    if((command < IOBOARD_CMD_MIN) || (command > IOBOARD_CMD_MAX)) {

        logprintf(DEBUG_ERRORS, "ERROR: Unknown command 0x%02X received\n", command);
        command_clear();
        return;
    }

    if(command_length < command_lengths[command])
        return;

    logprintf(DEBUG_EVENTS, "complete command received.\n");
    if(command_length > command_lengths[command]) {
        logprintf(DEBUG_ERRORS, "ERROR: command buffer longer than expected for command.\n");
    }

    if(command == IOBOARD_CMD_NONE)
        return;

    response_start();
    LED_set_info(1);
    switch(command) {
        case IOBOARD_CMD_READ:
        case IOBOARD_CMD_READ_SUM:
            process_command_read(command, command_bytes);
            break;

        case IOBOARD_CMD_WRITE:
        case IOBOARD_CMD_WRITE_SUM:
            process_command_write(command, command_bytes);
            break;

        case IOBOARD_CMD_SEROUT: {
            putchar(command_bytes[1]);
            response_append(IOBOARD_SUCCESS);
            break;
        }

        case IOBOARD_CMD_CONST: {
            logprintf(DEBUG_EVENTS, "CONST\n");
            isEmpty = queue_isempty(&con_queue.q);
            if(!isEmpty)
                response_append(IOBOARD_READY);
            else
                response_append(IOBOARD_NOT_READY);
            break;
        }

        case IOBOARD_CMD_CONIN: {
            unsigned char c;
            logprintf(DEBUG_EVENTS, "CONIN\n");
            isEmpty = queue_isempty(&con_queue.q);
            if(!isEmpty) {
                c = queue_deq(&con_queue.q);
                response_append(IOBOARD_SUCCESS);
                response_append(c);
            } else {
                printf("Hm, char wasn't actually ready at CONIN\n");
                response_append(IOBOARD_SUCCESS);
                response_append(0);
            }
            break;
        }

        default: {
            printf("unexpected command 0x%02X from z80!\n", command);
            break;
        }
    }
    LED_set_info(0);

    if(response_staging_length > 0) {
        logprintf(DEBUG_DATA, "will respond with %d\n", response_staging_length);
        command_clear();
        disable_interrupts();
        response_finish();
        enable_interrupts();
        gResponseWasWaiting = 1;
    }
}

void process_keyboard_queue()
{
    int isEmpty = queue_isempty(&kbd_queue.q);
    if(!isEmpty) {
        unsigned char kb = queue_deq(&kbd_queue.q);
        if(dump_keyboard_data)
            logprintf(DEBUG_DATA, "keyboard scan code: %02X\n", kb);
        kbd_process_byte(kb);
    }
}

void check_and_process_HALT()
{
    static int Z80WasInHALT = 0;
    gZ80IsInHALT = !HAL_GPIO_ReadPin(BUS_HALT_PORT, BUS_HALT_PIN_MASK);
    if(gZ80IsInHALT != Z80WasInHALT) {
        gOutputDevices = OUTPUT_TO_VIDEO | OUTPUT_TO_SERIAL;
        if(gZ80IsInHALT) {
            logprintf(DEBUG_EVENTS, "Z80 has HALTed.\n");
        } else {
            logprintf(DEBUG_EVENTS, "Z80 has exited HALT state.\n");
        }
        gOutputDevices = OUTPUT_TO_SERIAL;
        Z80WasInHALT = gZ80IsInHALT;
    }
}

void check_and_process_soft_reset()
{
    if(gResetTheZ80 || HAL_GPIO_ReadPin(RESET_BUTTON_PORT, RESET_BUTTON_PIN_MASK)) {
        while(HAL_GPIO_ReadPin(RESET_BUTTON_PORT, RESET_BUTTON_PIN_MASK));
        delay_ms(RESET_BUTTON_DELAY_MS);// software debounce
        gResetTheZ80 = 0;

        Z80_reset();

        logprintf(DEBUG_EVENTS, "Z80 was reset\n");
    }
}

void check_exceptional_conditions()
{
    if(gConsoleOverflowed) {
        logprintf(DEBUG_WARNINGS, "WARNING: Console input queue overflow\n");
        gConsoleOverflowed = 0;
    }

    if(gKeyboardOverflowed) {
        logprintf(DEBUG_WARNINGS, "WARNING: Keyboard data queue overflow\n");
        gKeyboardOverflowed = 0;
    }

    if(gReadWasAlreadyInactive) {
        logprintf(DEBUG_WARNINGS, "A");
        gReadWasAlreadyInactive = 0;
    }

    if(gUnclaimedRead) {
        BUS_write_IO(VIDEO_BOARD_OUTPUT_ADDR, 'R' + 128);
        logprintf(DEBUG_WARNINGS, "(%04X)", gUnclaimedReadAddress);
        gUnclaimedRead = 0;
    }

    if(gUnclaimedWrite) {
        BUS_write_IO(VIDEO_BOARD_OUTPUT_ADDR, 'W' + 128);
        logprintf(DEBUG_WARNINGS, "(%04X,%02X)", gUnclaimedWriteAddress, gUnclaimedWriteData);
        gUnclaimedWrite = 0;
    }
}

void process_monitor_queue()
{
    unsigned char isEmpty = queue_isempty(&mon_queue.q);
    static unsigned char escapeBackToMonitor = 0;

    if(!isEmpty) {
        unsigned char c = queue_deq(&mon_queue.q);
        if(gSerialInputToMonitor)
            process_local_key(c);
        else {
            if(escapeBackToMonitor == 0 && c == 1)
                escapeBackToMonitor = 1;
            else if(escapeBackToMonitor != 0 && c == 2) {
                escapeBackToMonitor = 0;
                gSerialInputToMonitor = 1;
                printf("Serial input returned to monitor\n");
            } else {
                escapeBackToMonitor = 0;
                console_enqueue_key(c);
            }
        }
    }
}

void process_serial_polling()
{
    // This is terrible; UART interrupt should fill a buffer and we should examine in here, not poll
    if(gStartAnotherUARTReceive) {
        gStartAnotherUARTReceive = 0;
        int result;
        if((result = HAL_UART_Receive_IT(&gUARTHandle, (uint8_t *)&gSerialCharBuffer, 1)) != HAL_OK) {
            /* error_code = gUARTHandle.State; */
        }
    }
}

int read_bootrom()
{
    FIL f;
    FRESULT result = f_open (&f, "bootrom.bin", FA_READ | FA_OPEN_EXISTING);

    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't open \"bootrom.bin\" for reading, FatFS result %d\n", result);
        return 0;
    }

    gZ80BootImageLength = f_size(&f);

    gZ80BootImage = (unsigned char*)malloc(gZ80BootImageLength);
    if(gZ80BootImage == NULL) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't allocate %lu bytes to read Z80 boot image\n", gZ80BootImageLength);
        return 0;
    }

