lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
    UINT wasread;
    result = f_read(&f, gZ80BootImage, gZ80BootImageLength, &wasread);
    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't read from \"bootrom.bin\", FatFS result %d\n", result);
        free(gZ80BootImage);
        gZ80BootImage = NULL;
        return 0;
    }

    if(wasread != gZ80BootImageLength) {
        logprintf(DEBUG_ERRORS, "ERROR: tried to read %lu bytes, only read %ld\n", gZ80BootImageLength, wasread);
        free(gZ80BootImage);
        gZ80BootImage = NULL;
        return 0;
    }

    f_close(&f);
    return 1;
}

#define PROP_READY_PIN_MASK GPIO_PIN_14
#define PROP_READY_PORT GPIOC

void VIDEO_init()
{
    // set PROP_READY pull up
    GPIO_InitTypeDef  GPIO_InitStruct;
    GPIO_InitStruct.Pin = PROP_READY_PIN_MASK;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(PROP_READY_PORT, &GPIO_InitStruct); 
}

#define PROP_READY_TIMEOUT_MILLIS 5000

void VIDEO_wait()
{
    if(ALICE3_VERSION == ALICE3_V3) {

        // Only on Alice3 V3 does ARM start before Propeller.
        // (On V1, ARM has 5-second delay while Propeller has 1-second delay)

        int started = HAL_GetTick();
        while(HAL_GPIO_ReadPin(PROP_READY_PORT, PROP_READY_PIN_MASK)) {
            int now = HAL_GetTick();
            if(now - started > PROP_READY_TIMEOUT_MILLIS) {
                printf("PANIC: timed out after waiting 5 seconds for PROP_READY\n");
                serial_flush();
                panic();
            }
        }
    }
}

const int gStandaloneARM = 0;

#define ALICE3_SRAM_SIZE (256 * 1024)

int BUS_check_RAM()
{
    int succeeded = 1;

    if((ALICE3_VERSION == ALICE3_V3) && !ALICE3_V3_ARM_IS_RAM) {
        int t;

        BUS_mastering_start();

        BUS_set_DATA(0);
        BUS_set_DATA_as_output();

        t = 0;
        for(unsigned int a = 0; a < ALICE3_SRAM_SIZE; a++) {
            BUS_write_memory_byte(a, t);
            t = (t + 251) % 256;
        }

        BUS_set_DATA_as_input();

        t = 0;
        for(unsigned int a = 0; a < ALICE3_SRAM_SIZE; a++) {
            unsigned char q = BUS_read_memory_byte(a);
            if(q != t) {
                printf("BUS_check_RAM : expected 0x%02X byte at RAM address 0x%X, read 0x%02X\n", t, a, q);
                succeeded = 0;
                break;
            }
            t = (t + 251) % 256;
        }

        BUS_set_DATA(gNextByteForReading);
        BUS_mastering_finish();

    }

    return succeeded;
}

int main()
{
    system_init();

    queue_init(&mon_queue.q, MON_QUEUE_CAPACITY);
    queue_init(&kbd_queue.q, KBD_QUEUE_CAPACITY);
    queue_init(&con_queue.q, CON_QUEUE_CAPACITY);

    LED_init();
    LED_beat_heart();

    setbuf(stdout, NULL);

    SERIAL_init(); // transmit and receive but global interrupts disabled
    LED_beat_heart();

    printf("\n\nAlice 3 I/O firmware, %s\n", IOBOARD_FIRMWARE_VERSION_STRING);
    printf("System core clock: %lu MHz\n", SystemCoreClock / 1000000);

    LED_beat_heart();
    serial_flush();

    RESET_BUTTON_init();

    if(!gStandaloneARM) {
        VIDEO_init();
        VIDEO_wait();

	BUS_reset_init(); // Pull Z80 RESET low (active), but Z80
			  // may not actually reset until some clock
			  // cycles have run.  So run clock below before
                          // trying to access bus
        BUS_init();

        VIDEO_start_clock();
        VIDEO_output_string("Alice 3 I/O firmware, " IOBOARD_FIRMWARE_VERSION_STRING "\r\n", 0);

        if(!BUS_check_RAM()) {
            panic();
        }

    }

    SPI_config_for_sd();
    LED_beat_heart();

    if(!sdcard_init())
        printf("Failed to start access to SD card as SPI!!\n");
    else 
        printf("SD Card interface is initialized for SPI\n");
    LED_beat_heart();
    serial_flush();

    if(0) {
        test_sd_card();
        LED_beat_heart();
    }

    FRESULT result = f_mount(&gFATVolume, "0:", 1);
    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: FATFS mount result is %d\n", result);
        panic();
    } else {
        printf("Mounted FATFS from SD card successfully.\n");
    }
    serial_flush();

    int success = read_bootrom();
    if(!success) {
        panic();
    }
    LED_beat_heart();

    success = read_disk_image_list();
    if(!success) {
        panic();
    }
    if(0)
        for(int i = 0; i < gDiskImageCount; i++) {
            printf("disk %c: \"%s\"\n", 'A' + i, gDiskImageFilenames[i]);
        }
    success = open_disk_images();
    if(!success) {
        panic();
    }
    LED_beat_heart();

    if(0) {
        unsigned char block[128];
        UINT wasread;
        for(int i = 0; i < gDiskImageCount; i++) {
            result = f_read(&gDiskImageFiles[i], block, sizeof(block), &wasread);
            printf("\"%s\", read resulted in %d, got %d bytes:\n", gDiskImageFilenames[i], result, wasread);
            dump_buffer_hex(4, block, sizeof(block));
        }
    }

    KBD_init();
    LED_beat_heart();

    if(!gStandaloneARM) { // Can't have floating BUS in test mode

        BUS_reset_start();
        if(!BUS_write_ROM_image(gZ80BootImage, gZ80BootImageLength)) {
            // panic();
        }
        delay_ms(1); // XXX delay for at least 4 Z80 clock cycles, maybe 10us
        BUS_reset_finish();
    }

    printf("* ");
    serial_flush();

    for(;;) {

        serial_try_to_transmit_buffers();
        LED_beat_heart();

        process_serial_polling();

        process_monitor_queue();

        check_and_process_command();

        process_keyboard_queue();

        check_exceptional_conditions();

        if(gResponseWasWaiting && !response_waiting) {
            logprintf(DEBUG_EVENTS, "response packet was read\n");
            gResponseWasWaiting = 0;
        }

        check_and_process_soft_reset();

        check_and_process_HALT();
    }

    // should not reach
    panic();
}
